/*
2016/04/11 11:00:43
学习目的:
熟练掌握for语句
*/
#include <stdio.h>
int main()
{
	int i;
	int sum1 = 0;//定义奇数变量和
	int sum2 = 0;//定义偶数变量和
	for (i = 1; i < 101;i++)
	{
		if (i%2==1)
		{
			sum1 += i; //成立奇数相加 不成立偶数相加执行else
		} 
		else
		{
			sum2 += i;
		}
	}
	printf("奇数之和是:%d\n",sum1);
	printf("偶数之和是:%d\n",sum2);
	printf("1到100之间的和是:%d\n",sum1+sum2);
	getchar();
	return 0;
}
/*
运行结果:
---------------------------------------------
奇数之和是:2500
偶数之和是:2550
1到100之间的和是:5050
---------------------------------------------
*/