/*
2016-04-11 10:16
学习目的:
熟练掌握for循环
*/
#include <stdio.h>
int main()
{
	int i;
	int sum = 0;
	int cnt = 0;
	float avg;//平均值一般用avg表示
	for (i = 1; i < 101;i+=2)
	{
		sum += i;//等价于sum=sum+i
		cnt++;//自动加1
	}
	avg = 1.0*sum / cnt; //1.0*sum 不强制转换最好的结果办法 结果也可以正常带小数
	printf("1到100之间奇数的和是:%d\n",sum);
	printf("1到100之间奇数的个数是:%d\n",cnt);
	printf("1到100之间奇数的平均值是:%f\n",avg); //这里注意,这里输出%f 不然结果全错
	getchar();
	return 0;
}
/*
运行结果:
---------------------------------------------
1到100之间奇数的和是:2500
1到100之间奇数的个数是:50
1到100之间奇数的平均值是:50.000000
---------------------------------------------
*/